synonyms_vocabulary = {
    'беспилотник_NOUN': 'аппарат_NOUN',
    'бпло_NOUN': 'аппарат_NOUN',
    'бпла_NOUN': 'аппарат_NOUN',
    'дрон_NOUN': 'аппарат_NOUN',
    'дронов_NOUN': 'аппарат_NOUN',
    'авиаудара_NOUN': 'авиаудар_NOUN',
    'обнародоваться_VERB': 'обнародовать_VERB',
    'аруначинать_VERB': 'начинать_VERB',
    'аргументироваться_VERB': 'аргументировать_VERB',
    'восполняться_VERB': 'восполнять_VERB',
    'декодирование_NOUN': 'расшифровка_NOUN',
    'аргументироваться_VERB': 'аргументировать_VERB',
    'адресант_NOUN': 'отправитель_NOUN',
    'частотность_NOUN': 'встречаемость_NOUN',
    'лингвокультурология_NOUN': 'культурология_NOUN',
    'психолингвистика_NOUN': 'лингвистика_NOUN',
    
}